[Killed] BlockStatement
src/form-sanitiser.js:1:54
-module.exports = function sanitizeFormData(formData) {
-  if (formData.trim() === "") {
-    return "I do not accept an empty string";
-  }
-
-  if (formData.length > 15) {
-    return "I do not accept a string longer than 15 characters";
-  }
-
-  if (formData.includes("http://")) {
-    return "I do not accept a URL";
-  }
-
-  if (formData.includes("<script>")) {
-    return "I do not accept scripts in the form data";
-  }
-
-  if (formData.includes("<img src=")) {
-    return "I do not accept image tags";
-  }
-
-  return "ok";
-};
+module.exports = function sanitizeFormData(formData) {};
 
killedBy: should not accept an empty string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "I do not accept an empty string"
Received: undefined

[Killed] ConditionalExpression
src/form-sanitiser.js:2:7
 module.exports = function sanitizeFormData(formData) {
-  if (formData.trim() === "") {
+  if (true) {
     return "I do not accept an empty string";
   }
killedBy: should not accept a string longer than 15 characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "I do not accept a string longer than 15 characters"
Received: "I do not accept an empty string"

[Killed] EqualityOperator
src/form-sanitiser.js:2:7
 module.exports = function sanitizeFormData(formData) {
-  if (formData.trim() === "") {
+  if (formData.trim() !== "") {
     return "I do not accept an empty string";
   }
killedBy: should not accept an empty string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "I do not accept an empty string"
Received: "ok"

[Killed] ConditionalExpression
src/form-sanitiser.js:6:7
     return "I do not accept an empty string";
   }
 
-  if (formData.length > 15) {
+  if (true) {
     return "I do not accept a string longer than 15 characters";
   }
killedBy: should accept a string of 15 characters or less
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "ok"
Received: "I do not accept a string longer than 15 characters"

[Killed] EqualityOperator
src/form-sanitiser.js:6:7
     return "I do not accept an empty string";
   }
 
-  if (formData.length > 15) {
+  if (formData.length >= 15) {
     return "I do not accept a string longer than 15 characters";
   }
killedBy: should accept a string of 15 characters or less
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "ok"
Received: "I do not accept a string longer than 15 characters"

[Killed] ConditionalExpression
src/form-sanitiser.js:10:7
     return "I do not accept a string longer than 15 characters";
   }
 
-  if (formData.includes("http://")) {
+  if (false) {
     return "I do not accept a URL";
   }
killedBy: should not accept a URL in a comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "I do not accept a URL"
Received: "ok"

[Killed] BlockStatement
src/form-sanitiser.js:10:37
     return "I do not accept a string longer than 15 characters";
   }
 
-  if (formData.includes("http://")) {
-    return "I do not accept a URL";
-  }
+  if (formData.includes("http://")) {}
 
   if (formData.includes("<script>")) {
killedBy: should not accept a URL in a comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "I do not accept a URL"
Received: "ok"

[Killed] ConditionalExpression
src/form-sanitiser.js:14:7
     return "I do not accept a URL";
   }
 
-  if (formData.includes("<script>")) {
+  if (true) {
     return "I do not accept scripts in the form data";
   }
killedBy: should accept a string of 15 characters or less
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "ok"
Received: "I do not accept scripts in the form data"

[Killed] ConditionalExpression
src/form-sanitiser.js:14:7
     return "I do not accept a URL";
   }
 
-  if (formData.includes("<script>")) {
+  if (false) {
     return "I do not accept scripts in the form data";
   }
killedBy: reject scripts in the form data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "I do not accept scripts in the form data"
Received: "ok"

[Killed] BlockStatement
src/form-sanitiser.js:18:39
     return "I do not accept scripts in the form data";
   }
 
-  if (formData.includes("<img src=")) {
-    return "I do not accept image tags";
-  }
+  if (formData.includes("<img src=")) {}
 
   return "ok";
killedBy: rejects image tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "I do not accept image tags"
Received: "ok"

[Killed] ConditionalExpression
src/form-sanitiser.js:18:7
     return "I do not accept scripts in the form data";
   }
 
-  if (formData.includes("<img src=")) {
+  if (false) {
     return "I do not accept image tags";
   }
killedBy: rejects image tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "I do not accept image tags"
Received: "ok"

[Killed] StringLiteral
src/form-sanitiser.js:22:10
     return "I do not accept image tags";
   }
 
-  return "ok";
+  return "";
 };
 
killedBy: should accept a string of 15 characters or less
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "ok"
Received: ""
